#### In `me-central-1`

```console
% AWS_DEFAULT_REGION=me-central-1 make testacc TESTARGS='-run=TestAccS3BucketLifecycleConfiguration_' PKG=s3 ACCTEST_PARALLELISM=4
make: Verifying source code with gofmt...
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go1.23.5 test ./internal/service/s3/... -v -count 1 -parallel 4  -run=TestAccS3BucketLifecycleConfiguration_ -timeout 360m -vet=off
2025/03/11 15:04:16 Initializing Terraform AWS Provider...
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_basic
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_basic
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_FilterWithPrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_FilterWithPrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_filterWithEmptyPrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_filterWithEmptyPrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeGreaterThan
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeGreaterThan
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeLessThan
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeLessThan
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeRange
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeRange
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeRangeAndPrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeRangeAndPrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_And_Tags
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_And_Tags
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_And_ZeroLessThan_ChangeOnUpdate
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_And_ZeroLessThan_ChangeOnUpdate
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_Tag
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_Tag
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_EmptyFilter_NonCurrentVersions
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_EmptyFilter_NonCurrentVersions
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_EmptyFilter_NonCurrentVersions_WithChange
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_EmptyFilter_NonCurrentVersions_WithChange
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_nonCurrentVersionExpiration
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_nonCurrentVersionExpiration
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_ruleAbortIncompleteMultipartUpload
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_ruleAbortIncompleteMultipartUpload
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RuleExpiration_expireMarkerOnly
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RuleExpiration_expireMarkerOnly
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RuleExpiration_emptyBlock
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RuleExpiration_emptyBlock
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RulePrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RulePrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionDate
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionDate
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionStorageClassOnly_intelligentTiering
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionStorageClassOnly_intelligentTiering
=== RUN   TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionZeroDays_intelligentTiering
=== PAUSE TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionZeroDays_intelligentTiering
=== RUN   TestAccS3BucketLifecycleConfiguration_basic
=== PAUSE TestAccS3BucketLifecycleConfiguration_basic
=== RUN   TestAccS3BucketLifecycleConfiguration_disappears
=== PAUSE TestAccS3BucketLifecycleConfiguration_disappears
=== RUN   TestAccS3BucketLifecycleConfiguration_filterWithPrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_filterWithPrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_filterWithEmptyPrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_filterWithEmptyPrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeGreaterThan
=== PAUSE TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeGreaterThan
=== RUN   TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeGreaterThanZero
=== PAUSE TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeGreaterThanZero
=== RUN   TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeLessThan
=== PAUSE TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeLessThan
=== RUN   TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeRange
=== PAUSE TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeRange
=== RUN   TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeRangeAndPrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeRangeAndPrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_Filter_PrefixToAnd
=== PAUSE TestAccS3BucketLifecycleConfiguration_Filter_PrefixToAnd
=== RUN   TestAccS3BucketLifecycleConfiguration_disableRule
=== PAUSE TestAccS3BucketLifecycleConfiguration_disableRule
=== RUN   TestAccS3BucketLifecycleConfiguration_multipleRules
=== PAUSE TestAccS3BucketLifecycleConfiguration_multipleRules
=== RUN   TestAccS3BucketLifecycleConfiguration_multipleRules_noFilterOrPrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_multipleRules_noFilterOrPrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_nonCurrentVersionExpiration
=== PAUSE TestAccS3BucketLifecycleConfiguration_nonCurrentVersionExpiration
=== RUN   TestAccS3BucketLifecycleConfiguration_nonCurrentVersionTransition
=== PAUSE TestAccS3BucketLifecycleConfiguration_nonCurrentVersionTransition
=== RUN   TestAccS3BucketLifecycleConfiguration_RulePrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_RulePrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_RulePrefixToFilter
=== PAUSE TestAccS3BucketLifecycleConfiguration_RulePrefixToFilter
=== RUN   TestAccS3BucketLifecycleConfiguration_Filter_Tag
=== PAUSE TestAccS3BucketLifecycleConfiguration_Filter_Tag
=== RUN   TestAccS3BucketLifecycleConfiguration_RuleExpiration_expireMarkerOnly
=== PAUSE TestAccS3BucketLifecycleConfiguration_RuleExpiration_expireMarkerOnly
=== RUN   TestAccS3BucketLifecycleConfiguration_RuleExpiration_emptyBlock
=== PAUSE TestAccS3BucketLifecycleConfiguration_RuleExpiration_emptyBlock
=== RUN   TestAccS3BucketLifecycleConfiguration_ruleAbortIncompleteMultipartUpload
=== PAUSE TestAccS3BucketLifecycleConfiguration_ruleAbortIncompleteMultipartUpload
=== RUN   TestAccS3BucketLifecycleConfiguration_TransitionDate_standardIa
=== PAUSE TestAccS3BucketLifecycleConfiguration_TransitionDate_standardIa
=== RUN   TestAccS3BucketLifecycleConfiguration_TransitionDate_intelligentTiering
=== PAUSE TestAccS3BucketLifecycleConfiguration_TransitionDate_intelligentTiering
=== RUN   TestAccS3BucketLifecycleConfiguration_TransitionStorageClassOnly_intelligentTiering
=== PAUSE TestAccS3BucketLifecycleConfiguration_TransitionStorageClassOnly_intelligentTiering
=== RUN   TestAccS3BucketLifecycleConfiguration_TransitionZeroDays_intelligentTiering
=== PAUSE TestAccS3BucketLifecycleConfiguration_TransitionZeroDays_intelligentTiering
=== RUN   TestAccS3BucketLifecycleConfiguration_TransitionUpdateBetweenDaysAndDate_intelligentTiering
=== PAUSE TestAccS3BucketLifecycleConfiguration_TransitionUpdateBetweenDaysAndDate_intelligentTiering
=== RUN   TestAccS3BucketLifecycleConfiguration_EmptyFilter_NonCurrentVersions
=== PAUSE TestAccS3BucketLifecycleConfiguration_EmptyFilter_NonCurrentVersions
=== RUN   TestAccS3BucketLifecycleConfiguration_migrate_noChange
=== PAUSE TestAccS3BucketLifecycleConfiguration_migrate_noChange
=== RUN   TestAccS3BucketLifecycleConfiguration_migrate_withChange
=== PAUSE TestAccS3BucketLifecycleConfiguration_migrate_withChange
=== RUN   TestAccS3BucketLifecycleConfiguration_Update_filterWithAndToFilterWithPrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_Update_filterWithAndToFilterWithPrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_directoryBucket
=== PAUSE TestAccS3BucketLifecycleConfiguration_directoryBucket
=== RUN   TestAccS3BucketLifecycleConfiguration_transitionDefaultMinimumObjectSize_update
=== PAUSE TestAccS3BucketLifecycleConfiguration_transitionDefaultMinimumObjectSize_update
=== RUN   TestAccS3BucketLifecycleConfiguration_transitionDefaultMinimumObjectSize_remove
=== PAUSE TestAccS3BucketLifecycleConfiguration_transitionDefaultMinimumObjectSize_remove
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_basic
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_basic
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_FilterWithPrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_FilterWithPrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeGreaterThan
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeGreaterThan
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeLessThan
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeLessThan
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeRange
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeRange
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeRangeAndPrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeRangeAndPrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_And_Tags
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_And_Tags
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_Tag
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_Tag
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_EmptyFilter_NonCurrentVersions
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_EmptyFilter_NonCurrentVersions
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_EmptyFilter_NonCurrentVersions_WithChange
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_EmptyFilter_NonCurrentVersions_WithChange
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_nonCurrentVersionExpiration
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_nonCurrentVersionExpiration
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_ruleAbortIncompleteMultipartUpload
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_ruleAbortIncompleteMultipartUpload
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RuleExpiration_expireMarkerOnly
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RuleExpiration_expireMarkerOnly
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RuleExpiration_emptyBlock
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RuleExpiration_emptyBlock
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RulePrefix
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RulePrefix
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionDate
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionDate
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionStorageClassOnly_intelligentTiering
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionStorageClassOnly_intelligentTiering
=== RUN   TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionZeroDays_intelligentTiering
=== PAUSE TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionZeroDays_intelligentTiering
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_basic
=== CONT  TestAccS3BucketLifecycleConfiguration_RulePrefixToFilter
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_FilterWithPrefix
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_EmptyFilter_NonCurrentVersions_WithChange
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_FilterWithPrefix (260.94s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_nonCurrentVersionExpiration
=== NAME  TestAccS3BucketLifecycleConfiguration_RulePrefixToFilter
    bucket_lifecycle_configuration_test.go:933: Step 3/4 error: Error running apply: exit status 1
        
        Error: updating S3 Bucket (tf-acc-test-3552062202887843462) Lifecycle Configuration
        
          with aws_s3_bucket_lifecycle_configuration.test,
          on terraform_plugin_test.tf line 16, in resource "aws_s3_bucket_lifecycle_configuration" "test":
          16: resource "aws_s3_bucket_lifecycle_configuration" "test" {
        
        While waiting: timeout while waiting for state to become 'true' (last state:
        'false', timeout: 3m0s)
--- FAIL: TestAccS3BucketLifecycleConfiguration_RulePrefixToFilter (398.93s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionZeroDays_intelligentTiering
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_EmptyFilter_NonCurrentVersions_WithChange (412.75s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionStorageClassOnly_intelligentTiering
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_basic (430.23s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionDate
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_nonCurrentVersionExpiration (240.23s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RulePrefix
=== NAME  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionStorageClassOnly_intelligentTiering
    bucket_lifecycle_configuration_upgrade_v5_86_0_test.go:1614: Step 2/2 error: Pre-apply plan check(s) failed:
        'aws_s3_bucket_lifecycle_configuration.test' - expected NoOp, got action(s): [create]
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionZeroDays_intelligentTiering (226.72s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RuleExpiration_emptyBlock
--- FAIL: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionStorageClassOnly_intelligentTiering (220.51s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RuleExpiration_expireMarkerOnly
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_TransitionDate (250.23s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_ruleAbortIncompleteMultipartUpload
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RulePrefix (232.68s)
=== CONT  TestAccS3BucketLifecycleConfiguration_TransitionUpdateBetweenDaysAndDate_intelligentTiering
=== NAME  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RuleExpiration_emptyBlock
    bucket_lifecycle_configuration_upgrade_v5_86_0_test.go:1327: Step 1/2 error: After applying this test step, the refresh plan was not empty.
        stdout
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          + create
        
        Terraform will perform the following actions:
        
          # aws_s3_bucket_lifecycle_configuration.test will be created
          + resource "aws_s3_bucket_lifecycle_configuration" "test" {
              + bucket                                 = "tf-acc-test-293969844977304669"
              + expected_bucket_owner                  = (known after apply)
              + id                                     = (known after apply)
              + transition_default_minimum_object_size = "all_storage_classes_128K"
        
              + rule {
                  + id     = "tf-acc-test-293969844977304669"
                  + prefix = (known after apply)
                  + status = "Enabled"
        
                  + expiration {
                      + days                         = (known after apply)
                      + expired_object_delete_marker = (known after apply)
                    }
        
                  + filter {
                      + object_size_greater_than = (known after apply)
                      + object_size_less_than    = (known after apply)
                      + prefix                   = "prefix/"
                    }
                }
            }
        
        Plan: 1 to add, 0 to change, 0 to destroy.
--- FAIL: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RuleExpiration_emptyBlock (219.43s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_basic
=== NAME  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RuleExpiration_expireMarkerOnly
    bucket_lifecycle_configuration_upgrade_v5_86_0_test.go:1235: Step 2/2 error: Pre-apply plan check(s) failed:
        'aws_s3_bucket_lifecycle_configuration.test' - expected NoOp, got action(s): [create]
--- FAIL: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_RuleExpiration_expireMarkerOnly (224.27s)
=== CONT  TestAccS3BucketLifecycleConfiguration_transitionDefaultMinimumObjectSize_remove
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_ruleAbortIncompleteMultipartUpload (228.48s)
=== CONT  TestAccS3BucketLifecycleConfiguration_transitionDefaultMinimumObjectSize_update
=== NAME  TestAccS3BucketLifecycleConfiguration_TransitionUpdateBetweenDaysAndDate_intelligentTiering
    bucket_lifecycle_configuration_test.go:1464: Step 2/5 error: After applying this test step, the refresh plan was not empty.
        stdout
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_s3_bucket_lifecycle_configuration.test will be updated in-place
          ~ resource "aws_s3_bucket_lifecycle_configuration" "test" {
                id                                     = "tf-acc-test-1328665625391856327"
                # (3 unchanged attributes hidden)
        
              ~ rule {
                    id     = "tf-acc-test-1328665625391856327"
                  + prefix = (known after apply)
                    # (1 unchanged attribute hidden)
        
                  ~ filter {
                      + object_size_greater_than = (known after apply)
                      + object_size_less_than    = (known after apply)
                        # (1 unchanged attribute hidden)
                    }
        
                  - noncurrent_version_transition {
                      - noncurrent_days = 0 -> null
                      - storage_class   = "INTELLIGENT_TIERING" -> null
                    }
                  + noncurrent_version_transition {
                      + newer_noncurrent_versions = (known after apply)
                      + noncurrent_days           = 0
                      + storage_class             = "INTELLIGENT_TIERING"
                    }
        
                  - transition {
                      - days          = 0 -> null
                      - storage_class = "INTELLIGENT_TIERING" -> null
                    }
                  + transition {
                      + date          = "2025-04-11T00:00:00Z"
                      + days          = (known after apply)
                      + storage_class = "INTELLIGENT_TIERING"
                    }
        
                    # (1 unchanged block hidden)
                }
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccS3BucketLifecycleConfiguration_TransitionUpdateBetweenDaysAndDate_intelligentTiering (350.65s)
=== CONT  TestAccS3BucketLifecycleConfiguration_directoryBucket
    directory_bucket_test.go:36: skipping acceptance testing: operation error S3: ListDirectoryBuckets, https response error StatusCode: 0, RequestID: , HostID: , request send failed, Get "https://s3express-control.me-central-1.amazonaws.com/?x-id=ListDirectoryBuckets": dial tcp: lookup s3express-control.me-central-1.amazonaws.com: no such host
--- SKIP: TestAccS3BucketLifecycleConfiguration_directoryBucket (0.06s)
=== CONT  TestAccS3BucketLifecycleConfiguration_Update_filterWithAndToFilterWithPrefix
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_basic (240.34s)
=== CONT  TestAccS3BucketLifecycleConfiguration_migrate_withChange
=== NAME  TestAccS3BucketLifecycleConfiguration_transitionDefaultMinimumObjectSize_remove
    bucket_lifecycle_configuration_test.go:1990: Step 3/4 error: Error running apply: exit status 1
        
        Error: updating S3 Bucket (tf-acc-test-3032088896448413823) Lifecycle Configuration
        
          with aws_s3_bucket_lifecycle_configuration.test,
          on terraform_plugin_test.tf line 16, in resource "aws_s3_bucket_lifecycle_configuration" "test":
          16: resource "aws_s3_bucket_lifecycle_configuration" "test" {
        
        While waiting: timeout while waiting for state to become 'true' (last state:
        'false', timeout: 3m0s)
--- FAIL: TestAccS3BucketLifecycleConfiguration_transitionDefaultMinimumObjectSize_remove (289.78s)
=== CONT  TestAccS3BucketLifecycleConfiguration_migrate_noChange
=== NAME  TestAccS3BucketLifecycleConfiguration_transitionDefaultMinimumObjectSize_update
    bucket_lifecycle_configuration_test.go:1915: Step 3/4 error: After applying this test step, the refresh plan was not empty.
        stdout
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_s3_bucket_lifecycle_configuration.test will be updated in-place
          ~ resource "aws_s3_bucket_lifecycle_configuration" "test" {
                id                                     = "tf-acc-test-5976503764830547581"
              ~ transition_default_minimum_object_size = "varies_by_storage_class" -> "all_storage_classes_128K"
                # (2 unchanged attributes hidden)
        
              ~ rule {
                    id     = "tf-acc-test-5976503764830547581"
                  + prefix = (known after apply)
                    # (1 unchanged attribute hidden)
        
                  ~ expiration {
                      ~ expired_object_delete_marker = false -> (known after apply)
                        # (1 unchanged attribute hidden)
                    }
                }
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccS3BucketLifecycleConfiguration_transitionDefaultMinimumObjectSize_update (334.75s)
=== CONT  TestAccS3BucketLifecycleConfiguration_EmptyFilter_NonCurrentVersions
--- PASS: TestAccS3BucketLifecycleConfiguration_migrate_noChange (118.07s)
=== CONT  TestAccS3BucketLifecycleConfiguration_TransitionDate_standardIa
=== NAME  TestAccS3BucketLifecycleConfiguration_migrate_withChange
    bucket_lifecycle_configuration_test.go:1706: Error running post-test destroy, there may be dangling resources: exit status 1
        
        Error: deleting S3 Bucket Lifecycle Configuration (tf-acc-test-948272838082472014)
        
        While waiting: found resource
--- FAIL: TestAccS3BucketLifecycleConfiguration_migrate_withChange (247.42s)
=== CONT  TestAccS3BucketLifecycleConfiguration_TransitionZeroDays_intelligentTiering
=== NAME  TestAccS3BucketLifecycleConfiguration_Update_filterWithAndToFilterWithPrefix
    bucket_lifecycle_configuration_test.go:1761: Step 2/4 error: Error running apply: exit status 1
        
        Error: updating S3 Bucket (tf-acc-test-2092266511203879611) Lifecycle Configuration
        
          with aws_s3_bucket_lifecycle_configuration.test,
          on terraform_plugin_test.tf line 16, in resource "aws_s3_bucket_lifecycle_configuration" "test":
          16: resource "aws_s3_bucket_lifecycle_configuration" "test" {
        
        While waiting: timeout while waiting for state to become 'true' (last state:
        'false', timeout: 3m0s)
--- PASS: TestAccS3BucketLifecycleConfiguration_TransitionDate_standardIa (107.77s)
=== CONT  TestAccS3BucketLifecycleConfiguration_TransitionStorageClassOnly_intelligentTiering
--- FAIL: TestAccS3BucketLifecycleConfiguration_Update_filterWithAndToFilterWithPrefix (293.86s)
=== CONT  TestAccS3BucketLifecycleConfiguration_TransitionDate_intelligentTiering
=== NAME  TestAccS3BucketLifecycleConfiguration_TransitionZeroDays_intelligentTiering
    bucket_lifecycle_configuration_test.go:1412: Step 1/2 error: After applying this test step, the refresh plan was not empty.
        stdout
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          + create
        
        Terraform will perform the following actions:
        
          # aws_s3_bucket_lifecycle_configuration.test will be created
          + resource "aws_s3_bucket_lifecycle_configuration" "test" {
              + bucket                                 = "tf-acc-test-3522245339147343411"
              + expected_bucket_owner                  = (known after apply)
              + id                                     = (known after apply)
              + transition_default_minimum_object_size = "all_storage_classes_128K"
        
              + rule {
                  + id     = "tf-acc-test-3522245339147343411"
                  + prefix = (known after apply)
                  + status = "Enabled"
        
                  + abort_incomplete_multipart_upload {
                      + days_after_initiation = 1
                    }
        
                  + filter {
                      + object_size_greater_than = (known after apply)
                      + object_size_less_than    = (known after apply)
                      + prefix                   = "prefix/"
                    }
        
                  + noncurrent_version_transition {
                      + newer_noncurrent_versions = (known after apply)
                      + noncurrent_days           = 0
                      + storage_class             = "INTELLIGENT_TIERING"
                    }
        
                  + transition {
                      + days          = 0
                      + storage_class = "INTELLIGENT_TIERING"
                    }
                }
            }
        
        Plan: 1 to add, 0 to change, 0 to destroy.
--- FAIL: TestAccS3BucketLifecycleConfiguration_TransitionZeroDays_intelligentTiering (93.03s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionStorageClassOnly_intelligentTiering
=== NAME  TestAccS3BucketLifecycleConfiguration_TransitionDate_intelligentTiering
    bucket_lifecycle_configuration_test.go:1312: Step 2/2 error running import: exit status 1
        
        Error: Cannot import non-existent remote object
        
        While attempting to import an existing object to
        "aws_s3_bucket_lifecycle_configuration.test", the provider detected that no
        object exists with the given id. Only pre-existing objects can be imported;
        check that the id is correct and that it is associated with the provider's
        configured region or endpoint, or use "terraform apply" to create a new
        remote object for this resource.
        
--- PASS: TestAccS3BucketLifecycleConfiguration_TransitionStorageClassOnly_intelligentTiering (92.00s)
=== CONT  TestAccS3BucketLifecycleConfiguration_RulePrefix
=== NAME  TestAccS3BucketLifecycleConfiguration_EmptyFilter_NonCurrentVersions
    bucket_lifecycle_configuration_test.go:1580: Step 3/4 error: Error running apply: exit status 1
        
        Error: updating S3 Bucket (tf-acc-test-6050328576458036741) Lifecycle Configuration
        
          with aws_s3_bucket_lifecycle_configuration.test,
          on terraform_plugin_test.tf line 16, in resource "aws_s3_bucket_lifecycle_configuration" "test":
          16: resource "aws_s3_bucket_lifecycle_configuration" "test" {
        
        While waiting: timeout while waiting for state to become 'true' (last state:
        'false', timeout: 3m0s)
--- FAIL: TestAccS3BucketLifecycleConfiguration_EmptyFilter_NonCurrentVersions (310.90s)
=== CONT  TestAccS3BucketLifecycleConfiguration_nonCurrentVersionTransition
=== NAME  TestAccS3BucketLifecycleConfiguration_TransitionDate_intelligentTiering
    panic.go:629: Error running post-test destroy, there may be dangling resources: exit status 1
        
        Error: deleting S3 Bucket Lifecycle Configuration (tf-acc-test-3952671543983149867)
        
        While waiting: found resource
--- FAIL: TestAccS3BucketLifecycleConfiguration_TransitionDate_intelligentTiering (209.77s)
=== CONT  TestAccS3BucketLifecycleConfiguration_nonCurrentVersionExpiration
--- PASS: TestAccS3BucketLifecycleConfiguration_RulePrefix (129.98s)
=== CONT  TestAccS3BucketLifecycleConfiguration_multipleRules_noFilterOrPrefix
--- PASS: TestAccS3BucketLifecycleConfiguration_nonCurrentVersionTransition (106.28s)
=== CONT  TestAccS3BucketLifecycleConfiguration_multipleRules
=== NAME  TestAccS3BucketLifecycleConfiguration_nonCurrentVersionExpiration
    bucket_lifecycle_configuration_test.go:793: Step 2/2 error running import: exit status 1
        
        Error: Cannot import non-existent remote object
        
        While attempting to import an existing object to
        "aws_s3_bucket_lifecycle_configuration.test", the provider detected that no
        object exists with the given id. Only pre-existing objects can be imported;
        check that the id is correct and that it is associated with the provider's
        configured region or endpoint, or use "terraform apply" to create a new
        remote object for this resource.
        
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionStorageClassOnly_intelligentTiering (252.84s)
=== CONT  TestAccS3BucketLifecycleConfiguration_disableRule
--- FAIL: TestAccS3BucketLifecycleConfiguration_nonCurrentVersionExpiration (96.53s)
=== CONT  TestAccS3BucketLifecycleConfiguration_Filter_PrefixToAnd
--- PASS: TestAccS3BucketLifecycleConfiguration_multipleRules_noFilterOrPrefix (104.31s)
=== CONT  TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeRangeAndPrefix
--- PASS: TestAccS3BucketLifecycleConfiguration_multipleRules (103.90s)
=== CONT  TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeRange
=== NAME  TestAccS3BucketLifecycleConfiguration_Filter_PrefixToAnd
    bucket_lifecycle_configuration_test.go:481: Step 1/4 error: After applying this test step, the refresh plan was not empty.
        stdout
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          + create
        
        Terraform will perform the following actions:
        
          # aws_s3_bucket_lifecycle_configuration.test will be created
          + resource "aws_s3_bucket_lifecycle_configuration" "test" {
              + bucket                                 = "tf-acc-test-3450452335602374238"
              + expected_bucket_owner                  = (known after apply)
              + id                                     = (known after apply)
              + transition_default_minimum_object_size = "all_storage_classes_128K"
        
              + rule {
                  + id     = "tf-acc-test-3450452335602374238"
                  + prefix = (known after apply)
                  + status = "Enabled"
        
                  + expiration {
                      + date                         = "2025-04-11T00:00:00Z"
                      + days                         = (known after apply)
                      + expired_object_delete_marker = (known after apply)
                    }
        
                  + filter {
                      + object_size_greater_than = (known after apply)
                      + object_size_less_than    = (known after apply)
                      + prefix                   = "prefix/"
                    }
                }
            }
        
        Plan: 1 to add, 0 to change, 0 to destroy.
--- FAIL: TestAccS3BucketLifecycleConfiguration_Filter_PrefixToAnd (94.05s)
=== CONT  TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeLessThan
=== NAME  TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeRangeAndPrefix
    bucket_lifecycle_configuration_test.go:427: Step 2/2 error running import: exit status 1
        
        Error: Cannot import non-existent remote object
        
        While attempting to import an existing object to
        "aws_s3_bucket_lifecycle_configuration.test", the provider detected that no
        object exists with the given id. Only pre-existing objects can be imported;
        check that the id is correct and that it is associated with the provider's
        configured region or endpoint, or use "terraform apply" to create a new
        remote object for this resource.
        
--- FAIL: TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeRangeAndPrefix (97.75s)
=== CONT  TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeGreaterThanZero
--- PASS: TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeLessThan (99.93s)
=== CONT  TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeGreaterThan
--- PASS: TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeGreaterThanZero (96.90s)
=== CONT  TestAccS3BucketLifecycleConfiguration_filterWithEmptyPrefix
--- PASS: TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeRange (161.07s)
=== CONT  TestAccS3BucketLifecycleConfiguration_filterWithPrefix
=== NAME  TestAccS3BucketLifecycleConfiguration_disableRule
    bucket_lifecycle_configuration_test.go:565: Step 2/5 error: After applying this test step, the refresh plan was not empty.
        stdout
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_s3_bucket_lifecycle_configuration.test will be updated in-place
          ~ resource "aws_s3_bucket_lifecycle_configuration" "test" {
                id                                     = "tf-acc-test-654328116249930557"
                # (3 unchanged attributes hidden)
        
              ~ rule {
                    id     = "tf-acc-test-654328116249930557"
                  + prefix = (known after apply)
                  ~ status = "Enabled" -> "Disabled"
        
                  ~ expiration {
                      ~ expired_object_delete_marker = false -> (known after apply)
                        # (1 unchanged attribute hidden)
                    }
                }
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- PASS: TestAccS3BucketLifecycleConfiguration_Filter_ObjectSizeGreaterThan (92.98s)
=== CONT  TestAccS3BucketLifecycleConfiguration_disappears
--- FAIL: TestAccS3BucketLifecycleConfiguration_disableRule (298.43s)
=== CONT  TestAccS3BucketLifecycleConfiguration_basic
=== NAME  TestAccS3BucketLifecycleConfiguration_filterWithEmptyPrefix
    bucket_lifecycle_configuration_test.go:185: Step 1/2 error: After applying this test step, the refresh plan was not empty.
        stdout
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          + create
        
        Terraform will perform the following actions:
        
          # aws_s3_bucket_lifecycle_configuration.test will be created
          + resource "aws_s3_bucket_lifecycle_configuration" "test" {
              + bucket                                 = "tf-acc-test-3148100671231398899"
              + expected_bucket_owner                  = (known after apply)
              + id                                     = (known after apply)
              + transition_default_minimum_object_size = "all_storage_classes_128K"
        
              + rule {
                  + id     = "tf-acc-test-3148100671231398899"
                  + prefix = (known after apply)
                  + status = "Enabled"
        
                  + expiration {
                      + date                         = "2025-04-11T00:00:00Z"
                      + days                         = (known after apply)
                      + expired_object_delete_marker = (known after apply)
                    }
        
                  + filter {
                      + object_size_greater_than = (known after apply)
                      + object_size_less_than    = (known after apply)
                        # (1 unchanged attribute hidden)
                    }
                }
            }
        
        Plan: 1 to add, 0 to change, 0 to destroy.
--- FAIL: TestAccS3BucketLifecycleConfiguration_filterWithEmptyPrefix (100.98s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionZeroDays_intelligentTiering
--- PASS: TestAccS3BucketLifecycleConfiguration_disappears (88.62s)
=== CONT  TestAccS3BucketLifecycleConfiguration_RuleExpiration_expireMarkerOnly
--- PASS: TestAccS3BucketLifecycleConfiguration_basic (100.61s)
=== CONT  TestAccS3BucketLifecycleConfiguration_ruleAbortIncompleteMultipartUpload
=== NAME  TestAccS3BucketLifecycleConfiguration_RuleExpiration_expireMarkerOnly
    bucket_lifecycle_configuration_test.go:1054: Step 2/4 error running import: exit status 1
        
        Error: Cannot import non-existent remote object
        
        While attempting to import an existing object to
        "aws_s3_bucket_lifecycle_configuration.test", the provider detected that no
        object exists with the given id. Only pre-existing objects can be imported;
        check that the id is correct and that it is associated with the provider's
        configured region or endpoint, or use "terraform apply" to create a new
        remote object for this resource.
        
--- FAIL: TestAccS3BucketLifecycleConfiguration_RuleExpiration_expireMarkerOnly (94.69s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_Tag
=== NAME  TestAccS3BucketLifecycleConfiguration_ruleAbortIncompleteMultipartUpload
    bucket_lifecycle_configuration_test.go:1176: Step 2/4 error running import: exit status 1
        
        Error: Cannot import non-existent remote object
        
        While attempting to import an existing object to
        "aws_s3_bucket_lifecycle_configuration.test", the provider detected that no
        object exists with the given id. Only pre-existing objects can be imported;
        check that the id is correct and that it is associated with the provider's
        configured region or endpoint, or use "terraform apply" to create a new
        remote object for this resource.
        
=== NAME  TestAccS3BucketLifecycleConfiguration_filterWithPrefix
    bucket_lifecycle_configuration_test.go:108: Step 3/4 error: After applying this test step, the refresh plan was not empty.
        stdout
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # aws_s3_bucket_lifecycle_configuration.test will be updated in-place
          ~ resource "aws_s3_bucket_lifecycle_configuration" "test" {
                id                                     = "tf-acc-test-3712001578501161111"
                # (3 unchanged attributes hidden)
        
              ~ rule {
                    id     = "tf-acc-test-3712001578501161111"
                  + prefix = (known after apply)
                    # (1 unchanged attribute hidden)
        
                  ~ expiration {
                      ~ date                         = "2025-04-11T00:00:00Z" -> "2026-03-11T00:00:00Z"
                      ~ expired_object_delete_marker = false -> (known after apply)
                        # (1 unchanged attribute hidden)
                    }
        
                  ~ filter {
                      + object_size_greater_than = (known after apply)
                      + object_size_less_than    = (known after apply)
                      ~ prefix                   = "logs/" -> "tmp/"
                    }
                }
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccS3BucketLifecycleConfiguration_filterWithPrefix (273.59s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionDate
--- FAIL: TestAccS3BucketLifecycleConfiguration_ruleAbortIncompleteMultipartUpload (134.48s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RulePrefix
=== NAME  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionZeroDays_intelligentTiering
    bucket_lifecycle_configuration_migrate_v0_test.go:2261: Step 2/2 error: Pre-apply plan check(s) failed:
        'aws_s3_bucket_lifecycle_configuration.test' - expected NoOp, got action(s): [create]
        error checking value for attribute at path: aws_s3_bucket_lifecycle_configuration.test.rule, err: list element index 0: expected 9 attributes for ObjectExact check, got 8 attributes
    panic.go:629: Error retrieving state, there may be dangling resources: exit status 1
        Failed to marshal state to json: schema version 0 for aws_s3_bucket_lifecycle_configuration.test in state does not match version 1 from the provider
--- FAIL: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionZeroDays_intelligentTiering (223.09s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RuleExpiration_emptyBlock
=== NAME  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_Tag
    bucket_lifecycle_configuration_migrate_v0_test.go:1153: Step 2/2 error: Post-apply refresh plan check(s) failed:
        'aws_s3_bucket_lifecycle_configuration.test' - expected NoOp, got action(s): [create]
--- FAIL: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_Tag (246.70s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RuleExpiration_expireMarkerOnly
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_TransitionDate (245.79s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_ruleAbortIncompleteMultipartUpload
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RulePrefix (255.60s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_nonCurrentVersionExpiration
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RuleExpiration_emptyBlock (263.24s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_EmptyFilter_NonCurrentVersions_WithChange
=== NAME  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RuleExpiration_expireMarkerOnly
    bucket_lifecycle_configuration_migrate_v0_test.go:1704: Step 2/2 error: Pre-apply plan check(s) failed:
        'aws_s3_bucket_lifecycle_configuration.test' - expected NoOp, got action(s): [create]
        error checking value for attribute at path: aws_s3_bucket_lifecycle_configuration.test.rule, err: list element index 0: expected 9 attributes for ObjectExact check, got 8 attributes
    panic.go:629: Error retrieving state, there may be dangling resources: exit status 1
        Failed to marshal state to json: schema version 0 for aws_s3_bucket_lifecycle_configuration.test in state does not match version 1 from the provider
--- FAIL: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_RuleExpiration_expireMarkerOnly (235.20s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_EmptyFilter_NonCurrentVersions
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_ruleAbortIncompleteMultipartUpload (247.55s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeRange
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_nonCurrentVersionExpiration (245.12s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_And_ZeroLessThan_ChangeOnUpdate
=== NAME  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_EmptyFilter_NonCurrentVersions
    bucket_lifecycle_configuration_migrate_v0_test.go:1259: Step 2/2 error: Pre-apply plan check(s) failed:
        'aws_s3_bucket_lifecycle_configuration.test' - expected NoOp, got action(s): [create]
        error checking value for attribute at path: aws_s3_bucket_lifecycle_configuration.test.rule, err: list element index 0: filter object attribute: list element index 0: expected 5 attributes for ObjectExact check, got 2 attributes
    panic.go:629: Error retrieving state, there may be dangling resources: exit status 1
        Failed to marshal state to json: schema version 0 for aws_s3_bucket_lifecycle_configuration.test in state does not match version 1 from the provider
--- FAIL: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_EmptyFilter_NonCurrentVersions (223.19s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_And_Tags
=== NAME  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_EmptyFilter_NonCurrentVersions_WithChange
    bucket_lifecycle_configuration_migrate_v0_test.go:1367: Step 2/2 error: Post-apply refresh plan check(s) failed:
        'aws_s3_bucket_lifecycle_configuration.test' - expected NoOp, got action(s): [update]
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeRange (245.15s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeRangeAndPrefix
--- FAIL: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_EmptyFilter_NonCurrentVersions_WithChange (512.16s)
=== CONT  TestAccS3BucketLifecycleConfiguration_Filter_Tag
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_And_Tags (242.69s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeRangeAndPrefix
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_And_ZeroLessThan_ChangeOnUpdate (414.36s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_EmptyFilter_NonCurrentVersions
--- PASS: TestAccS3BucketLifecycleConfiguration_Filter_Tag (168.10s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_Tag
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeRangeAndPrefix (327.96s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_And_Tags
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeRangeAndPrefix (224.58s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeGreaterThan
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_EmptyFilter_NonCurrentVersions (224.26s)
=== CONT  TestAccS3BucketLifecycleConfiguration_RuleExpiration_emptyBlock
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeLessThan
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_Tag (225.64s)
--- PASS: TestAccS3BucketLifecycleConfiguration_RuleExpiration_emptyBlock (108.76s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_filterWithEmptyPrefix
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_And_Tags (223.37s)
=== CONT  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_FilterWithPrefix
=== NAME  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeGreaterThan
    bucket_lifecycle_configuration_migrate_v0_test.go:404: Step 1/2 error: After applying this test step, the refresh plan was not empty.
        stdout
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          + create
        
        Terraform will perform the following actions:
        
          # aws_s3_bucket_lifecycle_configuration.test will be created
          + resource "aws_s3_bucket_lifecycle_configuration" "test" {
              + bucket                                 = "tf-acc-test-2267944658092646375"
              + id                                     = (known after apply)
              + transition_default_minimum_object_size = (known after apply)
        
              + rule {
                  + id     = "tf-acc-test-2267944658092646375"
                  + status = "Enabled"
        
                  + expiration {
                      + date                         = "2025-04-11T00:00:00Z"
                      + days                         = 0
                      + expired_object_delete_marker = (known after apply)
                    }
        
                  + filter {
                      + object_size_greater_than = "100"
                    }
                }
            }
        
        Plan: 1 to add, 0 to change, 0 to destroy.
--- FAIL: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeGreaterThan (223.63s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeLessThan
    bucket_lifecycle_configuration_upgrade_v5_86_0_test.go:47: skipping test: known possible eventual consistency error in v5.86.0: Error running apply: exit status 1
        
        Error: creating S3 Bucket (tf-acc-test-2831398469387743097) Lifecycle Configuration
        
          with aws_s3_bucket_lifecycle_configuration.test,
          on terraform_plugin_test.tf line 23, in resource "aws_s3_bucket_lifecycle_configuration" "test":
          23: resource "aws_s3_bucket_lifecycle_configuration" "test" {
        
        couldn't find resource
=== NAME  TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeLessThan
    bucket_lifecycle_configuration_migrate_v0_test.go:512: Step 2/2 error: Pre-apply plan check(s) failed:
        'aws_s3_bucket_lifecycle_configuration.test' - expected NoOp, got action(s): [create]
        error checking value for attribute at path: aws_s3_bucket_lifecycle_configuration.test.rule, err: list element index 0: expected 9 attributes for ObjectExact check, got 8 attributes
    panic.go:629: Error retrieving state, there may be dangling resources: exit status 1
        Failed to marshal state to json: schema version 0 for aws_s3_bucket_lifecycle_configuration.test in state does not match version 1 from the provider
--- FAIL: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_Filter_ObjectSizeLessThan (224.58s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeRange
--- SKIP: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeLessThan (64.17s)
=== CONT  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeGreaterThan
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_filterWithEmptyPrefix (253.10s)
--- PASS: TestAccS3BucketLifecycleConfiguration_frameworkMigrationV0_FilterWithPrefix (244.61s)
=== NAME  TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeGreaterThan
    bucket_lifecycle_configuration_upgrade_v5_86_0_test.go:228: Step 2/2 error: Pre-apply plan check(s) failed:
        'aws_s3_bucket_lifecycle_configuration.test' - expected NoOp, got action(s): [create]
--- FAIL: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeGreaterThan (220.43s)
--- PASS: TestAccS3BucketLifecycleConfiguration_upgradeV5_86_0_Filter_ObjectSizeRange (241.38s)
FAIL
FAIL	github.com/hashicorp/terraform-provider-aws/internal/service/s3	3858.942s
FAIL
make: *** [testacc] Error 1
```